; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-7-0)
(:domain BLOCKS)
(:objects A B C D E F G - block)
(:INIT (CLEAR G) (CLEAR D) (ONTABLE A) (ONTABLE B) (ON G F) (ON F E) (ON E C) (ON C A) (ON D B) (HANDEMPTY))
(:goal (AND (ON A B) (ON B C) (ON C D) (ON D E) (ON E F) (ON F G)))
)

; plan
1. (unstack g f)
   deleted: (clear g) (handempty) (on g f)
   added: (holding g) (clear f)
   goals met: 0 of 6
2. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 0 of 6
3. (unstack f e)
   deleted: (clear f) (handempty) (on f e)
   added: (holding f) (clear e)
   goals met: 0 of 6
4. (stack f g)
   deleted: (holding f) (clear g)
   added: (clear f) (handempty) (on f g)
   goals met: 1 of 6
5. (unstack e c)
   deleted: (clear e) (handempty) (on e c)
   added: (holding e) (clear c)
   goals met: 1 of 6
6. (stack e f)
   deleted: (holding e) (clear f)
   added: (clear e) (handempty) (on e f)
   goals met: 2 of 6
7. (unstack d b)
   deleted: (clear d) (handempty) (on d b)
   added: (holding d) (clear b)
   goals met: 2 of 6
8. (stack d e)
   deleted: (holding d) (clear e)
   added: (clear d) (handempty) (on d e)
   goals met: 3 of 6
9. (unstack c a)
   deleted: (clear c) (handempty) (on c a)
   added: (holding c) (clear a)
   goals met: 3 of 6
10. (stack c d)
   deleted: (holding c) (clear d)
   added: (clear c) (handempty) (on c d)
   goals met: 4 of 6
11. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 4 of 6
12. (stack b c)
   deleted: (holding b) (clear c)
   added: (clear b) (handempty) (on b c)
   goals met: 5 of 6
13. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 5 of 6
14. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 6 of 6
